b_propagation/3_pc_Re_tau_550_DNS/0/grad(U)
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volTensorField;
    location    "0";
    object      grad(U);
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 -1 0 0 0 0];

internalField   nonuniform List<tensor> 
400
(
(1.69346e-11 0 0 0 0 0 3.55271e-15 0 0)
(0 0 0 2.27374e-13 0 0 -3.55271e-15 0 0)
(-2.36658e-30 0 0 1.3955e-13 0 0 -7.70372e-31 0 0)
(0 0 0 1.73472e-16 0 0 0 0 0)
(3.9443e-31 0 0 1.27033e-13 0 0 -3.85186e-31 0 0)
(0 0 0 1.27033e-13 0 0 -3.55271e-15 0 0)
(3.9443e-31 0 0 -6.93889e-16 0 0 3.55271e-15 0 0)
(0 0 0 -1.04083e-15 0 0 0 0 0)
...
)
;

boundaryField
{
    walls
    {
        type            extrapolatedCalculated;
        value           nonuniform List<tensor> 8((1.69346e-11 0 0 2209.31 0 0 3.55271e-15 0 0) (0 0 0 2209.31 0 0 0 0 0) (0 0 0 2209.31 0 0 -3.55271e-15 0 0) (1.9387e-26 0 0 2209.31 0 0 -3.38656e-11 0 0) (2.77556e-15 0 0 -2209.31 0 0 0 0 0) (0 0 0 -2209.31 0 0 9.8126e-12 0 0) (0 0 0 -2209.31 0 0 0 0 0) (0 0 0 -2209.31 0 0 3.76023e-26 0 0));
    }
    inlet
    {
        type            cyclic;
    }
    outlet
    {
        type            cyclic;
    }
    sides
    {
        type            empty;
    }
}


// ************************************************************************* //
